Repository: almaz-uno/ilovlya-ui
Catalog: lib/src/localization/app_*.arb
Languages: ru

# appTitle
source: Ilovlya
ru: Иловля

source: Settings
ru: Настройки

source: Add new media
ru: Добавить новое медиа

source: Search...
ru: Поиск...

source: Language
ru: Язык

source: System language
ru: Системный язык

# copiedToClipboard
source: {text} copied to clipboard
ru: {text} скопировано в буфер обмена

# blockedAt
source: Blocked at {date}
ru: Заблокирован в

# quota
source: Quota: {quota}
ru: Квота

# used
source: Used: {used}
ru: Использовано

# free
source: Free: {free}
ru: Свободно

# files
source: Files: {files}
ru: Файлы

# local
source: Local: {local}
ru: Локально

# storage
source: Storage: {storage}
ru: Хранилище

source: Local media info
ru: Информация о локальных медиа

# recordings
source: Recordings: {count}
ru: Записи

# filesWithSize
source: Files: {number}, total size: {size}
ru: Файлов: {number}, общий размер: {size}

source: Clean stale downloaded media
ru: Очистить старые загруженные медиа

# filesCleanedMessage
source: {count} files, {size} cleaned
ru: {count} файлов, {size} очищено

source: Clean ALL downloaded media
ru: Очистить ВСЕ загруженные медиа

# cleanAllMetadataForRecordings
source: Clean ALL metadata for {count} recordings
ru: Очистить ВСЕ метаданные для {count} записей

# dataLocalPath
source: Data local path: {path}
ru: Локальный путь данных

# downloadedLocalMediaPath
source: Downloaded local media path: {path}
ru: Путь загруженных локальных медиа

source: cleaning stale media local files...
ru: очистка старых локальных медиафайлов...

# tapToPlayInEmbeddingPlayer
source: {filename} tap to play in embedding player
ru: {filename} нажмите для воспроизведения во встроенном плеере

source: No downloads for recording
ru: Нет загрузок для записи

source: Files for this recording
ru: Файлы для этой записи

# formatHeader
source: format
ru: формат

# resolutionHeader
source: resolution
ru: разрешение

# fpsHeader
source: fps
ru: кадр/с

# sizeHeader
source: size
ru: размер

source: Refresh list
ru: Обновить список

source: More options
ru: Больше опций

source: show seen
ru: показать просмотренные

source: show hidden
ru: показать скрытые

source: sort by created
ru: сортировать по созданию

source: sort by updated
ru: сортировать по обновлению

source: show only with server file
ru: показать только с серверным файлом

source: show only with local file
ru: показать только с локальным файлом

source: Paste from clipboard
ru: Вставить из буфера

source: Enter media URL
ru: Введите URL медиа

source: Lookup media info
ru: Поиск информации о медиа

# toViewInfoPressLookup
source: To view info press lookup button above
ru: Для просмотра информации нажмите кнопку поиска выше

source: successfully added
ru: успешно добавлено

source: Adding url
ru: Добавление URL

# noRecordingsInUrl
source: There is no recordings in the url
ru: В данном URL нет записей

# mediaInfoAcquiring
source: Media info acquiring in progress...
ru: Получение информации о медиа...

source: System Theme
ru: Системная тема

source: Light Theme
ru: Светлая тема

source: Dark Theme
ru: Тёмная тема

# autoMarkViewedWhenPlayed
source: Auto mark recording as viewed when fully played
ru: Автоматически отмечать запись как просмотренную при полном воспроизведении

# updateThumbnailProgress
source: Update thumbnail according to video viewing progress
ru: Обновлять миниатюру в соответствии с прогрессом просмотра видео

# showTechnicalInfo
source: Show additional technical info. For advanced users only!
ru: Показывать дополнительную техническую информацию. Только для продвинутых пользователей!

source: total size
ru: общий размер

# cleanStaleMedia
source: Clean stale downloaded media
ru: Очистить устаревшие загруженные медиа

# cleanAllMedia
source: Clean ALL downloaded media
ru: Очистить ВСЕ загруженные медиа

# cleanAllMetadata
source: Clean ALL metadata for recordings
ru: Очистить ВСЕ метаданные для записей

source: cleaned
ru: очищено

source: recordings cleaned
ru: записей очищено

# cleaningStaleFiles
source: cleaning stale media local files...
ru: очистка устаревших локальных медиафайлов...

source: loading...
ru: загрузка...

source: Loading info...
ru: Загрузка информации...

# downloadsInfoLoading
source: Downloads info is loading...
ru: Информация о загрузках загружается...

# noFormatsForRecord
source: No formats for the record
ru: Нет форматов для записи

# createdAt
source: Created at: {date} ({time} ago)
ru: Создано

# updatedAt
source: Updated at: {date} ({time} ago)
ru: Обновлено

source: ago
ru: назад

# copyVideoUrl
source: Copy video URL to the clipboard
ru: Копировать URL видео в буфер

# cleanServerContent
source: Clean all downloaded content on the server
ru: Очистить весь загруженный контент на сервере

# cleanDeviceMedia
source: Clean all downloaded media from the device
ru: Очистить все загруженные медиа с устройства

# refreshRecord
source: Refresh record (reread from the server)
ru: Обновить запись (перечитать с сервера)

# downloadServerFormat
source: Download this format again on the server (prepare for viewing)
ru: Загрузить этот формат снова на сервер (подготовить для просмотра)

# openMediaKit
source: Open with MediaKit with handler
ru: Открыть с MediaKit с обработчиком

source: Do with it...
ru: Что с этим делать...

# copyFileLink
source: Copy file link to clipboard
ru: Копировать ссылку на файл в буфер

# copyCurlCommand
source: Copy curl command to clipboard
ru: Копировать curl команду в буфер

# playEmbeddedMpv
source: Play with embedded mpv player
ru: Воспроизвести во встроенном mpv плеере

# playEmbeddedMpvFlipped
source: Play with embedded mpv player with horizontal flip
ru: Воспроизвести во встроенном mpv плеере с горизонтальным отражением

# openDefaultApp
source: Open in default application
ru: Открыть в приложении по умолчанию

# deleteServerFile
source: Delete file on the server and free server usage quota
ru: Удалить файл на сервере и освободить серверную квоту

source: Delete local file
ru: Удалить локальный файл

# shareDownloadUrl
source: Share the download URL in...
ru: Поделиться ссылкой для загрузки в...

source: Download local file
ru: Загрузить локальный файл

# localFileDownloaded
source: Local file is downloaded. Click to play.
ru: Локальный файл загружен. Нажмите для воспроизведения.

# downloadToLocalStorage
source: Download media to local storage
ru: Загрузить медиа в локальное хранилище

# markAsSeen
source: Mark this recording as seen
ru: Отметить эту запись как просмотренную

# markAsUnseen
source: Mark this recording as unseen
ru: Отметить эту запись как непросмотренную

# hideRecording
source: Hide this recording (archive it)
ru: Скрыть эту запись (архивировать)

# showRecording
source: Show this recording (unarchive it)
ru: Показать эту запись (разархивировать)

# preparationStarting
source: Preparation for {formatId} is starting
ru: Подготовка {formatId} начинается

source: Local downloading
ru: Локальная загрузка

source: preparing...
ru: подготовка...

source: Acquiring info...
ru: Получение информации...

# waitingDataFromServer
source: waiting data from the server...
ru: ожидание данных с сервера...

source: Seek to Position
ru: Перейти к позиции

source: Duration
ru: Длительность

source: Hours
ru: Часы

source: Minutes
ru: Минуты

source: Seconds
ru: Секунды

source: Cancel
ru: Отмена

source: Seek
ru: Перейти

# positionExceedsDuration
source: Position exceeds video duration
ru: Позиция превышает длительность видео

source: With audio handler!
ru: С аудиообработчиком!

source: seen at
ru: просмотрено

source: duration
ru: длительность

source: position
ru: позиция

source: buffered
ru: буферизовано

source: buffering
ru: буферизация

source: volume
ru: громкость

source: audio bitrate
ru: аудио битрейт

source: audio device
ru: аудио устройство

source: size
ru: размер

source: video params
ru: параметры видео

source: audio params
ru: параметры аудио

source: Playing from
ru: Воспроизводится из

# unauthorized
source: Unauthorized: please check and specify token and server URL in settings
ru: Не авторизован: проверьте и укажите токен и URL сервера в настройках

# noRecordings
source: No recordings. Check you filter settings or API token value.
ru: Нет записей. Проверьте настройки фильтра или значение API токена.

source: User profile
ru: Профиль пользователя

source: Housekeeping
ru: Управление файлами

# yourTokenProvidedByBot
source: Your token, provided by the bot
ru: Ваш токен, предоставленный ботом

# serverUrlProvidedByBot
source: Server URL, provided by the bot
ru: URL сервера, предоставленный ботом

source: Application color theme
ru: Цветовая тема приложения

source: Player speed rate
ru: Скорость воспроизведения

source: Media directory
ru: Директория медиафайлов

source: Are you sure?
ru: Вы уверены?

# deleteAllDownloadedMediaFiles
source: This will delete ALL downloaded media files
ru: Это удалит ВСЕ загруженные медиафайлы

# deleteAllMetadataMessage
source: This will delete ALL metadata for {count} recordings, downloaded media files will be retained. This data can be downloaded from the server.
ru: Это удалит ВСЕ метаданные для {count} записей, загруженные медиафайлы будут сохранены. Эти данные можно загрузить с сервера.

# deleteAllFilesOnServer
source: Delete all files on the server?
ru: Удалить все файлы на сервере?

# deleteAllLocalFilesOnDevice
source: Delete all local files on the device?
ru: Удалить все локальные файлы с устройства?

source: Delete server media file?
ru: Удалить медиафайл на сервере?

source: Delete local downloaded media file?
ru: Удалить локальный загруженный медиафайл?

# continueButton
source: Continue
ru: Продолжить

# downloadThisFormatOnServer
source: Download this format and the best audio on the server (prepare for viewing)
ru: Загрузить этот формат и лучшее аудио на сервер (подготовить для просмотра)

# copyUrlFragmentToClipboard
source: Copy URL this fragment into clipboard
ru: Скопировать URL этого фрагмента в буфер обмена

# bestAudio
source: Best audio (ba)
ru: Лучшее аудио (ba)

source: Common available formats:
ru: Общие доступные форматы:

source: Available formats:
ru: Доступные форматы:

# downloadExactFormat
source: Download exact this format (prepare this format for viewing)
ru: Скачать именно этот формат (подготовить для просмотра)

# selectedPosition
source: Selected position: {position}
ru: Выбранная позиция: {position}

source: Position exceeds video duration
ru: Позиция превышает длительность видео

# cleanAllDownloadedContentOnServer
source: Clean all downloaded content on the server
ru: Очистить все загруженное содержимое на сервере

# cleanAllDownloadedMediaFromDevice
source: Clean all downloaded media from the device
ru: Очистить все загруженные медиа с устройства

source: Downloads info is loading...
ru: Информация о загрузках загружается...

# copyVideoUrlToClipboard
source: Copy video URL to the clipboard
ru: Копировать URL видео в буфер обмена

# downloadThisFormatAgainOnServer
source: Download this format again on the server (prepare for viewing)
ru: Загрузить этот формат снова на сервере (подготовить для просмотра)

# openWithMediaKitHandler
source: Open with MediaKit with handler
ru: Открыть с помощью MediaKit

source: Copy file link to clipboard
ru: Скопировать ссылку на файл в буфер обмена

source: Copy curl command to clipboard
ru: Скопировать команду curl в буфер обмена

source: Play with embedded mpv player
ru: Воспроизвести с помощью встроенного mpv плеера

source: Play with embedded mpv player with horizontal flip
ru: Воспроизвести с помощью встроенного mpv плеера с горизонтальным отражением

source: Open in default application
ru: Открыть в приложении по умолчанию

# deleteFileOnServerAndFreeQuota
source: Delete file on the server and free server usage quota
ru: Удалить файл с сервера и освободить квоту

# unexpectedDownloadStatus
source: Unexpected download status {status}
ru: Неожиданный статус загрузки {status}

# localFileDownloadedClickToPlay
source: Local file is downloaded. Click to play.
ru: Локальный файл загружен. Нажмите для воспроизведения.

source: Download media to local storage
ru: Загрузить медиа в локальное хранилище

# markRecordingAsSeen
source: Mark this recording as seen
ru: Отметить эту запись как просмотренную

# markRecordingAsUnseen
source: Mark this recording as unseen
ru: Отметить эту запись как непросмотренную

source: ext
ru: расш.

source: resolution
ru: разрешение

source: fps
ru: кадр/с

source: format
ru: формат

# preparingEllipsis
source: preparing...
ru: подготовка...

# successfullyAddedMessage
source: {title} successfully added
ru: {title} успешно добавлено

# addingUrlWithVariable
source: Adding url {url}...
ru: Добавление URL {url}...

# createdAtWithDate
source: Created at: {date} ({timeAgo})
ru: Создано: {date} ({timeAgo})

# updatedAtWithDate
source: Updated at: {date} ({timeAgo})
ru: Обновлено: {date} ({timeAgo})

# localDownloadingStatus
source: Local downloading {status}: {filename} {estimate}
ru: Локальная загрузка {status}: {filename} {estimate}

# recordingsCleanedMessage
source: {count} recordings cleaned
ru: {count} записей очищено

# copiedToClipboardMessage
source: {text} copied to clipboard
ru: {text} скопировано в буфер обмена

# quotaLabel
source: Quota: {quota}
ru: Квота: {quota}

# usedLabel
source: Used: {used}
ru: Использовано: {used}

# freeLabel
source: Free: {free}
ru: Свободно: {free}

# filesLabel
source: Files: {files}
ru: Файлы: {files}

# localLabel
source: Local: {local}
ru: Локально: {local}

# storageLabel
source: Storage: {storage}
ru: Хранилище: {storage}

# recordingsLabel
source: Recordings: {recordings}
ru: Записи: {recordings}

# filesTotalSizeLabel
source: Files: {count}, total size: {size}
ru: Файлы: {count}, общий размер: {size}

# blockedAtLabel
source: Blocked at {date}
ru: Заблокировано {date}

# noRecordingsCheckFilterOrToken
source: No recordings. Check you filter settings or API token value.
ru: Нет записей. Проверьте настройки фильтра или значение API токена.

# unauthorizedCheckTokenAndServer
source: Unauthorized: please check and specify token and server URL in settings
ru: Не авторизован: проверьте и укажите токен и URL сервера в настройках

# errorCheckTokenAndServer
source: please check and specify token and server URL in settings
ru: проверьте и укажите токен и URL сервера в настройках

source: Loading in progress...
ru: Загрузка...

# addArbitraryMedia
source: Add an arbitrary media
ru: Добавить произвольное медиа

source: Add from clipboard
ru: Добавить из буфера обмена

# quotaUsageInfo
source: quote: {quota} usage: {usage} ({files}) free: {free}{store}
ru: квота: {quota} использовано: {usage} ({files}) свободно: {free}{store}

# debugCreatedAt
source: created at
ru: создано

# debugUpdatedAt
source: updated at
ru: обновлено

# debugDuration
source: duration
ru: длительность

# debugPosition
source: position
ru: позиция

# debugBuffered
source: buffered
ru: буферизовано

# debugBuffering
source: buffering
ru: буферизация

# debugVolume
source: volume
ru: громкость

# debugAudioBitrate
source: audio bitrate
ru: битрейт аудио

# debugAudioDevice
source: audio device
ru: аудиоустройство

# debugSize
source: size
ru: размер

# debugVideoParams
source: video params
ru: параметры видео

# debugAudioParams
source: audio params
ru: параметры аудио

# sizeLabel
source: Size
ru: Размер

# playWithEmbeddedMpvPlayerHorizontalFlip
source: Play with embedded mpv player with horizontal flip
ru: Воспроизвести с помощью встроенного mpv плеера с горизонтальным отражением

# shareDownloadUrlIn
source: Share the download URL in...
ru: Поделиться ссылкой для скачивания...

# scrollUp
source: Scroll to top
ru: Прокрутить наверх

# scrollDown
source: Scroll to bottom
ru: Прокрутить вниз

# speedSlow
source: slow
ru: медленно

# speedNormal
source: normal
ru: нормально

# speedMedium
source: medium
ru: средне

# speedFast
source: fast
ru: быстро

# speedVeryFast
source: very fast
ru: очень быстро

# speedSuperFast
source: super fast
ru: супер быстро
